case/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 54;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 54;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 54;
    }

    frontAndBack
    {
        type            empty;
    }
}
