case/0/omega
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 17400;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 17400;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            omegaWallFunction;
        value           uniform 17400;
    }

    frontAndBack
    {
        type            empty;
    }
}
