case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale 1;

vertices
(
    (-0.05 0.01 0)
    ( 0.00 0.01 0)
    (-0.05 0.03 0)
    ( 0.00 0.03 0)
    ( 0.00 0.00 0)
    ( 0.30 0.00 0)
    ( 0.30 0.01 0)
    ( 0.30 0.03 0)

    (-0.05 0.01 0.001)
    ( 0.00 0.01 0.001)
    (-0.05 0.03 0.001)
    ( 0.00 0.03 0.001)
    ( 0.00 0.00 0.001)
    ( 0.30 0.00 0.001)
    ( 0.30 0.01 0.001)
    ( 0.30 0.03 0.001)
);

blocks
(
    hex (0 1 3 2 8 9 11 10) (30 20 1) simpleGrading (1 1 1)
    hex (4 5 6 1 12 13 14 9) (120 10 1) simpleGrading (1 1 1)
    hex (1 6 7 3 9 14 15 11) (120 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 10 2)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (5 6 14 13)
            (6 7 15 14)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (4 12 9 1)
            (4 5 13 12)
            (2 3 11 10)
            (3 7 15 11)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 2 3 1)
            (4 1 6 5)
            (1 3 7 6)
            (8 9 11 10)
            (12 13 14 9)
            (9 14 15 11)
        );
    }
);

mergePatchPairs
(
);
